### Foundational packages ###
brew 'asdf'                           # tool version manager
brew 'autojump'                       # cd on steroids: <https://github.com/wting/autojump>
brew 'bash-completion'                # Basic tab completion
brew 'bash'                           # I got used to bash and never learned zsh. Install the latest version, mac's default is pretty old
tap 'borkdude/brew'
brew 'borkdude/brew/babashka'         # Handy for quick Clojure
brew 'coreutils'                      # Make Mac more Linux-y
brew 'diffutils'                      # Mac's default is old
brew 'findutils'                      # GNU find to replace weird BSD one
brew 'fzf'                            # fuzzyfinder: https://github.com/junegunn/fzf
brew 'git'                            # Update to newest on older systems
brew 'gnu-sed'                        # BSD sed is weird (on Mac)
brew 'grep'                           # BSD grep is also weird (on Mac)
brew "highlight"                      # For `less` syntax highlighting
brew 'jq'                             # JSON parsing tool: <https://stedolan.github.io/jq/>
brew 'nmap'                           # Mac really doesn't ship with this?!
brew "pipdeptree"                     # It's crazy this isn't built-in
brew 'pstree'                         # Gives you something like ps f on linux since there's no f on mac
brew 'rename'                         # Mass file renaming
brew 'ripgrep'                        # provides rg for fast recursive searches
brew 'telnet'                         # Not part of coreutils for some reason
brew 'tig'                            # git curses client
brew 'trash'                          # rm-like command that moves things to the trash (I may be a monster, but I'm a cautious monster)
brew 'tree'                           # Tree view of file structures
brew 'watch'                          # Gotta have watch
brew 'wget'                           # Mac really doesn't ship with this?!

tap "superatomic/bundle-extensions"   # Used by my custom brew wrapper

# Borrowed from https://github.com/Homebrew/homebrew-bundle/issues/521
Dir.glob(File.join(File.dirname(__FILE__), '.Brewfile.*')) do |brewfile|
    eval(IO.read(brewfile), binding)
end
