#   homebrew/boneyard/apg # Secure password generator. Removed from formulas?
brew 'autojump'                                   # cd on steroids: <https://github.com/wting/autojump>
brew 'bash'                                       # Update to latest
brew 'bash-completion'                            # Basic tab completion
brew 'coreutils'                                  # Make Mac more Linux-y
brew 'cowsay'                                     # Moo
brew 'findutils'                                  # GNU find to replace weird BSD one
brew 'fzf'                                        # fuzzyfinder: https://github.com/junegunn/fzf
brew 'git'                                        # Update to newest on older systems
brew 'gnu-sed'                                    # BSD sed is weird (on Mac)
brew 'homebrew/dupes/grep', args: ['--with-default-names']   # BSD grep is also weird (on Mac)
brew 'htop-osx'                                   # Gotta have htop
brew 'jq'                                         # JSON parsing tool: <https://stedolan.github.io/jq/>
brew 'nmap'                                       # Mac really doesn't ship with this?!
brew 'pip-completion'                             # Bash completion for pip
brew 'pstree'                                     # Gives you something like ps f on linux since there's no f on mac
#Let's see if we can get by without this brew 'python'  # Update to 2.7.10 which fixes major SSL flaws
brew 'python3'                                    # If only this were default
brew 'rename'                                     # Mass file renaming
brew 'sl'                                         # Choo choo!
brew 'source-highlight'                           # For `less` syntax highlighting
brew 'telnet'                                     # Not part of coreutils for some reason
brew 'the_silver_searcher'                        # provides ag for fast recursive searches
brew 'tig'                                        # git curses client
brew 'trash'                                      # rm-like command that moves things to the trash (I may be a monster, but I'm a cautious monster)
brew 'tree'                                       # Tree view of file structures
brew 'watch'                                      # Gotta have watch
brew 'wget'                                       # Mac really doesn't ship with this?!

# Source: https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'                                # Quick Look plugin that colorizes code
cask 'qlstephen'                                  # Quick Look plugin that previews plain text files with unknown extensions
cask 'qlmarkdown'                                 # Quick Look plugin that renders markdown
cask 'quicklook-json'                             # Quick Look plugin for json


cask 'iTerm2'            , {appdir: '/Applications'}   # A better terminal emulator
cask 'Alfred'            , {appdir: '/Applications'}   # Like a text editor's palettes, but for the whole computer
cask 'Dash'              , {appdir: '/Applications'}   # Offline documentation browser (integrates with Alfred)
cask 'visual-studio-code', {appdir: '/Applications'}   # My editor of choice
cask 'BetterTouchTool'   , {appdir: '/Applications'}   # Tiling and gesture/keyboard remaps
cask 'HyperSwitch'       , {appdir: '/Applications'}   # Window-based switcher
cask 'Itsycal'           , {appdir: '/Applications'}   # Replaces the menu bar datetime display and adds a calendar panel on click
cask 'AppCleaner'        , {appdir: '/Applications'}   # Fully uninstall apps

cask 'Docker'            , {appdir: '/Applications'}
cask 'google-chrome'     , {appdir: '/Applications'}
cask 'evernote'          , {appdir: '/Applications'}
cask 'slack'             , {appdir: '/Applications'}
cask 'VLC'               , {appdir: '/Applications'}
cask 'Lastpass'          , {appdir: '/Applications'}

# cask 'gifox'               , {appdir: '/Applications'}  # Make gif screen recordings, good for demonstrating QA
